ИСПП/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <comment>Количество товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <comment>Сумма в валюте регламентированного учета без НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>НДС в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураЗаказа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЗакупки</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.СпецификацияКДоговору</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>БезвозмезднаяПередачаМежбюджетная</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПередачаПрочее</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеВнутриведомственное</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеМежбюджетное</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступлениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяПередачаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВнутриведомственноеПеремещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровИзОтделения</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиентаПрошлыхПериодов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОтПереоценкиТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Изготовление</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаОшибокОкругления</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоВозврату</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтпускТоваровВОтделение</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовНаСебестоимость</name>
  </enumValues>
  <enumValues>
    <name>РасходыОтПереоценкиТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияВРозницу</name>
  </enumValues>
  <enumValues>
    <name>РеализацияМатериальныхЗапасов</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваров</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоНазначениюВрача</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоТребованию</name>
  </enumValues>
  <enumValues>
    <name>СторноРеализации</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияНаРасходы</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/AccumulationRegisters/Закупки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетСебестоимостиТоваров

Функция ХозяйственныеОперацииКорректировки() Экспорт
	
	Операции = Новый Массив;
	Операции.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	
	Возврат Операции;
	
КонецФункции

Процедура СформироватьДвижениеКорректировки(ПараметрыРасчета, Выборка) Экспорт
	
	ИмяРегистра = СоздатьНаборЗаписей().Метаданные().Имя;
	ЗаполняемыеПоля = Новый Структура;
	ЗаполняемыеПоля.Вставить("Период");
	ЗаполняемыеПоля.Вставить("ХозяйственнаяОперация");
	ЗаполняемыеПоля.Вставить("АналитикаУчетаНоменклатуры");
	ЗаполняемыеПоля.Вставить("Организация");
	ЗаполняемыеПоля.Вставить("ПодразделениеОрганизации");
	ЗаполняемыеПоля.Вставить("Контрагент");
	ЗаполняемыеПоля.Вставить("ДоговорКонтрагента");
	ЗаполняемыеПоля.Вставить("СтавкаНДС");
	ЗаполняемыеПоля.Вставить("Склад");
	ЗаполняемыеПоля.Вставить("ДокументДвижения");
	ЗаполняемыеПоля = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ЗаполняемыеПоля);
	
	Запись = РасчетСебестоимостиТоваров.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, Выборка, ЗаполняемыеПоля);
	Запись.ДокументЗакупки = Выборка.ДокументИсточник;
	Запись.ЗаказПоставщику = Выборка.Заказ;
	Запись.Спецификация    = Выборка.Спецификация;
	Запись.Стоимость       = Выборка.СтоимостьКорректировка + Выборка.СуммаДопРасходовКорректировка;
	Запись.СтоимостьБезНДС = Выборка.СтоимостьБезНДСКорректировка + Выборка.СуммаДопРасходовБезНДСКорректировка;
	Запись.СтоимостьРегл   = Выборка.СтоимостьРеглКорректировка;
	
КонецПроцедуры

#КонецОбласти // РасчетСебестоимостиТоваров

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
